Revit 2026 API

# DocumentNewOpening(Level, Level, CurveArray) Method

---

Creates a new shaft opening between a set of levels.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Opening NewOpening(
	Level bottomLevel,
	Level topLevel,
	CurveArray profile
)
```
```vb
Public Function NewOpening (
	bottomLevel As Level,
	topLevel As Level,
	profile As CurveArray
) As Opening
```
```cpp
public:
Opening^ NewOpening(
	Level^ bottomLevel,
	Level^ topLevel,
	CurveArray^ profile
)
```
```fsharp
member NewOpening :
        bottomLevel : Level *
        topLevel : Level *
        profile : CurveArray -> Opening
```

#### Parameters

bottomLevel Level
     bottom level
topLevel Level
     top level
profile CurveArray
     profile of the opening.

#### Return Value

Opening If successful, an Opening object is returned.

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown if the bottom level does not exist in the given document. |
| ArgumentException | Thrown if the top level does not exist in the given document. |

This method forms an opening on floor, ceiling and roof. Make sure topLevel is higher than bottomLevel, otherwise an exception will be returned.

#### Reference

Document Class

NewOpening Overload

Autodesk.Revit.Creation Namespace